In [1]:
import numpy as np
import pandas as pd

In [21]:
s = pd.Series([1,3,5,np.nan,6,8]) # 기본 1차원 배열
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [20]:
dates= pd.date_range('20181110', periods=3)
dates

DatetimeIndex(['2018-11-10', '2018-11-11', '2018-11-12'], dtype='datetime64[ns]', freq='D')

In [22]:
df=pd.DataFrame(np.random.randn(3,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2018-11-10 -0.115743 -0.220694 -0.551102  0.531611
2018-11-11 -0.246951 -0.245546  0.528054 -0.725126
2018-11-12  0.904656  0.134273  0.759955 -1.049642

In [25]:
rawdata={'Name' : ['김수연', '이경현', '위규복', '하종우', '엄현호'], 'Age' : [26,27,27,28,25] ,'Live' : ['신촌', '혜화', '일산', '서초', '일산']}
rawdata

{'Name': ['김수연', '이경현', '위규복', '하종우', '엄현호'],
 'Age': [26, 27, 27, 28, 25],
 'Live': ['신촌', '혜화', '일산', '서초', '일산']}

In [29]:
df2 = pd.DataFrame(rawdata)
df2

  Name  Age Live
0  김수연   26   신촌
1  이경현   27   혜화
2  위규복   27   일산
3  하종우   28   서초
4  엄현호   25   일산

In [28]:
pd.DataFrame(df2, columns=["Age"])

   Age
0   26
1   27
2   27
3   28
4   25

In [31]:
df2.Name

0    김수연
1    이경현
2    위규복
3    하종우
4    엄현호
Name: Name, dtype: object

In [33]:
df2.dtypes

Name    object
Age      int64
Live    object
dtype: object

In [37]:
df2.loc[0] # 첫번째 행의 모든 column이 출력됨!

Name    김수연
Age      26
Live     신촌
Name: 0, dtype: object

In [38]:
df2['Age'].iloc[1:] # Age column 의 index 1부터 출력!

1    27
2    27
3    28
4    25
Name: Age, dtype: int64